Natnatee/CH32V003F4P6_REMOTE/src/main.c
        // --- 3. สแกนปุ่มกด Keypad 4x4 ---
        uint8_t key = keypad_scan(&row, &col);

        if (key != 0 && key != last_key)
        {
            last_key = key;

            // ==========================================
            // กรณีที่ 1: หน้าแสดงรหัส IR ที่อ่านได้ (โหมด LEARN)
            // ==========================================
            if (ir_captured)
            {
                if (key == 16)
                {
                    // ปุ่ม 16: CANCEL ยกเลิก ไม่เซฟรหัส
                    ir_captured = 0;
                    get_footer_str(footer_buf, current_mode, current_profile);
                    oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                }
                else
                {
                    // กดปุ่มในตาราง 1..15 เพื่อบันทึกรหัสลง Flash ROM ทันที
                    int idx = key_to_index(key);
                    if (idx >= 0)
                    {
                        active_codes[idx] = captured_code;
                        flash_save_profile(current_profile, active_codes, current_profile_name, active_protocol, active_bits);
                        ir_captured = 0;

                        get_footer_str(footer_buf, current_mode, current_profile);
                        oled_render_grid_screen(current_profile_name, footer_buf, key, 1, active_codes);
                        Delay_Ms(300);
                        oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                    }
                }
            }
            // ==========================================
            // กรณีที่ 2: หน้ากวาดยิงรหัส (โหมด NEW Preview 5 วินาที)
            // ==========================================
            else if (current_mode == MODE_NEW && new_preview_active && !mode_select_active)
            {
                if (key == 4)
                {
                    // ปุ่ม 4: UP เลื่อนรหัสถัดไป (+1)
                    new_brute_idx = (new_brute_idx + 1) % TOTAL_BRUTE_COMMANDS;
                    uint32_t test_code = generate_brute_code(current_profile, (uint8_t)new_brute_idx);
                    ir_send_code(test_code);
                    oled_render_new_code_screen(current_profile_name, test_code, new_brute_idx, TOTAL_BRUTE_COMMANDS);
                    new_preview_ticks = 0;
                }
                else if (key == 8)
                {
                    // ปุ่ม 8: DOWN เลื่อนรหัสก่อนหน้า (-1)
                    new_brute_idx = (new_brute_idx + TOTAL_BRUTE_COMMANDS - 1) % TOTAL_BRUTE_COMMANDS;
                    uint32_t test_code = generate_brute_code(current_profile, (uint8_t)new_brute_idx);
                    ir_send_code(test_code);
                    oled_render_new_code_screen(current_profile_name, test_code, new_brute_idx, TOTAL_BRUTE_COMMANDS);
                    new_preview_ticks = 0;
                }
                else if (key == 12)
                {
                    // ปุ่ม 12: OK ยิงรหัสเดิมซ้ำอีกรอบ (RETRY)
                    uint32_t test_code = generate_brute_code(current_profile, (uint8_t)new_brute_idx);
                    ir_send_code(test_code);
                    oled_render_new_code_screen(current_profile_name, test_code, new_brute_idx, TOTAL_BRUTE_COMMANDS);
                    new_preview_ticks = 0;
                }
                else if (key == 16)
                {
                    // ปุ่ม 16: BACK ยกเลิกหน้านี้ กลับสู่ตารางทันที
                    new_preview_active = 0;
                    new_preview_ticks = 0;
                    get_footer_str(footer_buf, current_mode, current_profile);
                    oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                }
                else
                {
                    // กดปุ่มในตาราง 1..15 เพื่อบันทึกรหัสที่เพิ่งยิงลง Flash ROM!
                    int idx = key_to_index(key);
                    if (idx >= 0)
                    {
                        uint32_t test_code = generate_brute_code(current_profile, (uint8_t)new_brute_idx);
                        active_codes[idx] = test_code;
                        flash_save_profile(current_profile, active_codes, current_profile_name, active_protocol, active_bits);
                        new_preview_active = 0;
                        new_preview_ticks = 0;

                        get_footer_str(footer_buf, current_mode, current_profile);
                        oled_render_grid_screen(current_profile_name, footer_buf, key, 1, active_codes);
                        Delay_Ms(300);
                        oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                    }
                }
            }
            // ==========================================
            // กรณีที่ 3: โหมด RENAME (แก้ไขชื่อโปรไฟล์)
            // ==========================================
            else if (current_mode == MODE_RENAME && !mode_select_active)
            {
                if (rename_editing == 0)
                {
                    // --- ขั้นตอนเลือก Profile ที่ต้องการแก้ชื่อ ---
                    if (key == 4)
                    {
                        // ปุ่ม 4: UP เลื่อน Profile ถัดไป
                        current_profile = (current_profile + 1) % TOTAL_PROFILES_COUNT;
                        flash_load_profile(current_profile, active_codes, current_profile_name, &active_protocol, &active_bits);
                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    }
                    else if (key == 8)
                    {
                        // ปุ่ม 8: DOWN เลื่อน Profile ก่อนหน้า
                        current_profile = (current_profile + TOTAL_PROFILES_COUNT - 1) % TOTAL_PROFILES_COUNT;
                        flash_load_profile(current_profile, active_codes, current_profile_name, &active_protocol, &active_bits);
                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    }
                    else if (key == 12)
                    {
                        // ปุ่ม 12: OK ยืนยันเข้าสู่การพิมพ์/แก้ไขชื่อ (Cursor Active)
                        rename_editing = 1;
                        rename_cursor = 0;
                        memset(edit_name_buf, ' ', 7);
                        edit_name_buf[7] = '\0';
                        int cur_len = strlen(current_profile_name);
                        for (int i = 0; i < cur_len && i < 7; i++) {
                            edit_name_buf[i] = current_profile_name[i];
                        }
                        oled_render_rename_screen(edit_name_buf, rename_cursor, 1, current_profile, 1);
                    }
                    else if (key == 16)
                    {
                        // ปุ่ม 16: BACK เข้าสู่การเลือกโหมด
                        mode_select_active = 1;
                        selected_mode = current_mode;
                        mode_blink_state = 1;
                        blink_tick = 0;
                        oled_render_grid_screen(current_profile_name, mode_select_labels[selected_mode], 0, 0, active_codes);
                    }
                }
                else
                {
                    // --- ขั้นตอนกำลังพิมพ์ชื่อ (Cursor Active เลื่อนได้ครบทั้ง 7 ช่อง) ---
                    if (key == 4)
                    {
                        // ปุ่ม 4: เลื่อน Cursor ซ้าย (-1)
                        rename_cursor = (rename_cursor + 6) % 7;
                        oled_render_rename_screen(edit_name_buf, rename_cursor, 1, current_profile, 1);
                    }
                    else if (key == 8)
                    {
                        // ปุ่ม 8: เลื่อน Cursor ขวา (+1)
                        rename_cursor = (rename_cursor + 1) % 7;
                        oled_render_rename_screen(edit_name_buf, rename_cursor, 1, current_profile, 1);
                    }
                    else if (key == 12)
                    {
                        // ปุ่ม 12: OK บันทึกชื่อลง Flash ROM ถาวร!
                        for (int i = 6; i >= 0; i--) {
                            if (edit_name_buf[i] == ' ') edit_name_buf[i] = '\0';
                            else break;
                        }
                        if (strlen(edit_name_buf) == 0) {
                            strncpy(edit_name_buf, profile_names[current_profile], 7);
                        }
                        strncpy(current_profile_name, edit_name_buf, 7);
                        current_profile_name[7] = '\0';

                        flash_save_profile(current_profile, active_codes, current_profile_name, active_protocol, active_bits);
                        rename_editing = 0;

                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    }
                    else if (key == 16)
                    {
                        // ปุ่ม 16: CANCEL ยกเลิก ไม่เซฟชื่อ
                        rename_editing = 0;
                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    }
                    else
                    {
                        // ปุ่มในตาราง 1..15: วนตัวอักษรลงที่ตำแหน่ง Cursor
                        int idx = key_to_index(key);
                        if (idx >= 0)
                        {
                            const char *letters = key_letters[idx];
                            int let_len = strlen(letters);

                            char cur_c = edit_name_buf[rename_cursor];
                            int found_pos = -1;
                            for (int i = 0; i < let_len; i++) {
                                if (letters[i] == cur_c) {
                                    found_pos = i;
                                    break;
                                }
                            }

