Natnatee/CH32V003F4P6_REMOTE/src/main.c
                            int next_pos = (found_pos + 1) % let_len;
                            edit_name_buf[rename_cursor] = letters[next_pos];

                            oled_render_rename_screen(edit_name_buf, rename_cursor, 1, current_profile, 1);
                        }
                    }
                }
            }
            // ==========================================
            // กรณีที่ 4: หน้าเลือกโหมด (Footer กระพริบ)
            // ==========================================
            else if (mode_select_active)
            {
                if (key == 4)
                {
                    // ปุ่ม 4: UP
                    selected_mode = (RemoteMode)((selected_mode + 5) % 6);
                    mode_blink_state = 1;
                    blink_tick = 0;
                    oled_render_grid_screen(current_profile_name, mode_select_labels[selected_mode], 0, 0, active_codes);
                }
                else if (key == 8)
                {
                    // ปุ่ม 8: DOWN
                    selected_mode = (RemoteMode)((selected_mode + 1) % 6);
                    mode_blink_state = 1;
                    blink_tick = 0;
                    oled_render_grid_screen(current_profile_name, mode_select_labels[selected_mode], 0, 0, active_codes);
                }
                else if (key == 12)
                {
                    // ปุ่ม 12: OK ยืนยันโหมด
                    current_mode = selected_mode;
                    mode_select_active = 0;
                    new_preview_active = 0;
                    new_brute_idx = 0;
                    rename_editing = 0;

                    if (current_mode == MODE_CALC) {
                        calc_init();
                        calc_render();
                    } else if (current_mode == MODE_METER) {
                        ina226_init();
                        ina226_render();
                    } else if (current_mode == MODE_RENAME) {
                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    } else {
                        get_footer_str(footer_buf, current_mode, current_profile);
                        oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                    }
                }
                else if (key == 16)
                {
                    // ปุ่ม 16: BACK ยกเลิก
                    mode_select_active = 0;
                    if (current_mode == MODE_RENAME) {
                        oled_render_rename_screen(current_profile_name, 0, 0, current_profile, 0);
                    } else if (current_mode == MODE_CALC) {
                        calc_render();
                    } else if (current_mode == MODE_METER) {
                        ina226_render();
                    } else {
                        get_footer_str(footer_buf, current_mode, current_profile);
                        oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                    }
                }
            }
            // ==========================================
            // กรณีที่ 5: อยู่ในหน้าตาราง 3x4 ปกติ (SEND / LEARN / NEW)
            // ==========================================
            else
            {
                if (key == 16)
                {
                    // ปุ่ม 16: BACK เข้าสู่การเลือกโหมด
                    mode_select_active = 1;
                    selected_mode = current_mode;
                    mode_blink_state = 1;
                    blink_tick = 0;
                    oled_render_grid_screen(current_profile_name, mode_select_labels[selected_mode], 0, 0, active_codes);
                }
                else if (current_mode == MODE_NEW && (key == 4 || key == 8))
                {
                    // ในโหมด NEW: กด 4 (UP) หรือ 8 (DOWN) เพื่อเริ่มกวาดยิงรหัส 256 คำสั่ง
                    if (key == 4) {
                        new_brute_idx = (new_brute_idx + 1) % TOTAL_BRUTE_COMMANDS;
                    } else {
                        new_brute_idx = (new_brute_idx + TOTAL_BRUTE_COMMANDS - 1) % TOTAL_BRUTE_COMMANDS;
                    }

                    uint32_t test_code = generate_brute_code(current_profile, (uint8_t)new_brute_idx);
                    ir_send_code(test_code);
                    oled_render_new_code_screen(current_profile_name, test_code, new_brute_idx, TOTAL_BRUTE_COMMANDS);
                    new_preview_active = 1;
                    new_preview_ticks = 0;
                }
                else if (key == 4)
                {
                    // ปุ่ม 4: UP เลื่อน Profile ถัดไป (01 ➡️ 02 ➡️ ... ➡️ 16)
                    current_profile = (current_profile + 1) % TOTAL_PROFILES_COUNT;
                    flash_load_profile(current_profile, active_codes, current_profile_name, &active_protocol, &active_bits);
                    get_footer_str(footer_buf, current_mode, current_profile);
                    oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                }
                else if (key == 8)
                {
                    // ปุ่ม 8: DOWN เลื่อน Profile ก่อนหน้า (16 ⬅️ 15 ⬅️ ...)
                    current_profile = (current_profile + TOTAL_PROFILES_COUNT - 1) % TOTAL_PROFILES_COUNT;
                    flash_load_profile(current_profile, active_codes, current_profile_name, &active_protocol, &active_bits);
                    get_footer_str(footer_buf, current_mode, current_profile);
                    oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
                }
                else if (key == 12)
                {
                    // ปุ่ม 12: OK (สงวนไว้สำหรับฟังก์ชัน Profile/IR ในอนาคต)
                }
                else
                {
                    // ปุ่มในตาราง 3x4 (1..15)
                    int idx = key_to_index(key);
                    if (idx >= 0)
                    {
                        uint32_t code = active_codes[idx];

